[
    {
        "id": 1,
        "title": "React Dashboard",
        "description": "A comprehensive administrative dashboard built with React and TailwindCSS. Features real-time data visualization, user management, and customizable widgets.",
        "longDescription": "This React Dashboard project showcases a modern approach to admin interfaces. It utilizes a modular architecture, leveraging React hooks and Context API for state management. The UI is built with TailwindCSS for rapid, consistent styling, and Recharts for interactive data visualization. Key features include a multi-layered sidebar, dynamic data tables with filtering and sorting, and a fully responsive layout optimized for all devices. The project also demonstrates best practices in frontend development, including component-based architecture and performance optimization.",
        "thumbnail": "https://images.unsplash.com/photo-1633356122544-f134324a6cee?w=800&q=80",
        "videoUrl": "https://assets.mixkit.co/videos/preview/mixkit-digital-animation-of-a-futuristic-dashboard-32692-large.mp4",
        "tags": [
            "React",
            "GSAP",
            "Three.js",
            "WebGL"
        ],
        "link": "https://github.com"
    },
    {
        "id": 2,
        "title": "Cloud API Services",
        "description": "Scalable RESTful API built with Node.js and Express, integrated with MongoDB. Optimized for high performance and secure data handling.",
        "longDescription": "The Cloud API Services project focuses on providing a robust and scalable backend for modern web applications. Built on Node.js and Express.js, it handles millions of requests with ease. It features comprehensive API documentation using Swagger, JWT-based authentication for secure access, and integration with MongoDB for high-speed data storage and retrieval. The codebase follows a clean architecture pattern, ensuring maintainability and ease of extension for future features like real-time notifications via WebSockets.",
        "thumbnail": "https://images.unsplash.com/photo-1555066931-4365d14bab8c?w=800&q=80",
        "videoUrl": "https://assets.mixkit.co/videos/preview/mixkit-man-working-on-his-computer-at-night-42261-large.mp4",
        "tags": [
            "Node.js",
            "Express",
            "MongoDB",
            "Cloud"
        ],
        "link": "https://github.com"
    },
    {
        "id": 3,
        "title": "Fintech App UI",
        "description": "A sleek and intuitive mobile interface for financial management. Focuses on user experience and visual clarity.",
        "longDescription": "The Fintech App UI project is a deep dive into mobile UX design and implementation. Using React Native, I've created a series of interactive and visually stunning screens for money management. The app includes complex animation patterns using Reanimated, custom charts for spending analysis, and a seamless onboarding flow. The design system is strictly followed to maintain visual consistency across all modules, from transaction history to investment tracking.",
        "thumbnail": "https://images.unsplash.com/photo-1498050108023-c5249f4df085?w=800&q=80",
        "videoUrl": "https://assets.mixkit.co/videos/preview/mixkit-top-view-of-a-smartphone-with-a-loading-screen-42353-large.mp4",
        "tags": [
            "React Native",
            "UI/UX",
            "Mobile",
            "Finance"
        ],
        "link": "https://github.com"
    },
    {
        "id": 4,
        "title": "AI Platform Hub",
        "description": "An interactive hub for AI model management and data processing, featuring advanced visualization and real-time interaction.",
        "longDescription": "The AI Platform Hub is designed for data scientists and AI engineers to manage their models efficiently. It integrates with various AI services to provide a centralized dashboard for monitoring performance and adjusting parameters in real-time. The platform features advanced data visualization using D3.js, allowing users to explore complex datasets with ease. The responsive design ensures that insights are accessible whether on a desktop or a tablet in the field.",
        "thumbnail": "https://images.unsplash.com/photo-1518770660439-4636190af475?w=800&q=80",
        "videoUrl": "https://assets.mixkit.co/videos/preview/mixkit-hands-of-a-man-working-on-a-computer-42345-large.mp4",
        "tags": [
            "AI",
            "Visualization",
            "Next.js",
            "D3.js"
        ],
        "link": "https://github.com"
    }
]