[
    {
        "id": 1,
        "title": "Food Delivery System",
        "description": "A real-time ecosystem connecting Customers, Restaurants, and Delivery Partners.",
        "longDescription": "This platform is a robust monorepo orchestration of specialized applications, ensuring seamless data flow and specialized interfaces for every stakeholder. It's an real-time ecosystem connecting Customers, Restaurants, and Delivery Partners to process the live orders and seamless delivery of the food to the users.",
        "thumbnail": "https://pub-88542caeb82a4635aa980b4aeb205cb5.r2.dev/portfolio/wallpaper/only.png",
        "videoUrl": "https://pub-88542caeb82a4635aa980b4aeb205cb5.r2.dev/portfolio/only.mkv",
        "tags": [
            "React",
            "Next.js",
            "Motion",
            "css",
            "tailwind",
            "Express",
            "Node.js",
            "postgreSQL",
            "RabbitMQ",
            "Turborepo",
            "Web Sockets",
            "Real-time",
            "Message Brokers",
            "Email Service Integration",
            "Figma Design",
            "Prisma",
            "JWT Authentication",
            "RESTful APIs",
            "Docker",
            "Typescript",
            "Cloudflare R2"          
        ],
        "stack": [
            {"name": "Turborepo",
                "logo": "https://cdn.simpleicons.org/vercel/FFFFFF"
            },
            {
                "name": "React",
                "logo": "https://cdn.simpleicons.org/react/61DAFB"
            },
            {
                "name": "Next.js",
                "logo": "https://cdn.simpleicons.org/nextdotjs/FFFFFF"
            },
            {
                "name": "Motion-Three",
                "logo": "https://cdn.simpleicons.org/three.js/FFFFFF"
            },
            {
                "name": "Tailwind",
                "logo": "https://cdn.simpleicons.org/tailwindcss/06B6D4"
            },
            {
                "name": "Node.js",
                "logo": "https://cdn.simpleicons.org/node.js/339933"
            },
            {
                "name": "Express",
                "logo": "https://cdn.simpleicons.org/express/FFFFFF"
            },
            {
                "name": "PostgreSQL",
                "logo": "https://cdn.simpleicons.org/postgresql/316192"
            },
            {
                "name": "RabbitMQ",
                "logo": "https://cdn.simpleicons.org/rabbitmq/FF6600"
            },
            {
                "name": "Socket.io",
                "logo": "https://cdn.simpleicons.org/socketdotio/010101"
            },
            {
                "name": "Figma",
                "logo": "https://cdn.simpleicons.org/figma/F24E1E"
            },
            {
                "name": "Prisma",
                "logo": "https://cdn.simpleicons.org/prisma/2D3748"
            },
            {
                "name": "Docker",
                "logo": "https://cdn.simpleicons.org/docker/2496ED"
            },
            {
                "name": "TypeScript",
                "logo": "https://cdn.simpleicons.org/typescript/3178C6"
            },
            {
                "name": "Cloudflare",
                "logo": "https://cdn.simpleicons.org/cloudflare/F38020"
            }
        ],
        "link": "https://github.com/rahulsainijeelo",
        "sections": {
            "challenges": "Implementing real-time order updates and maintaining smooth performance during high-frequency data changes across multiple user interfaces. To make a secure, scalable and robust system that can handle thousands of concurrent users. Sending transactional and authentication emails reliably was also concerning and new to me.",
            "solutions": "Utilized WebSockets for real-time communication, ensuring instantaneous updates across all user interfaces. Employed RabbitMQ as a message broker with a orderOutbox table to manage order processing efficiently. For email services, integrated with third-party providers like Zoho's Zeptomail to ensure reliable delivery of transactional emails. Adopted JWT for secure authentication and Prisma ORM with Postgres for efficient database management.",
            "features": "Implemented order worker to handle the missed orders by the Message Broker for error free handling. Implemented Cleam Ui's for Users (seller_front) that is the main page for order placement and user ui, Restaurant Partner application with going offline and online functionlities to recieve/not recieve orders (In Real Time). Also Implemted Delivery Parner ui with same functionlities to process the to pickup and deliver the ready orders from the restauntants to the user locations. also implemented Admin Dashboard to monitor the whole system with order tracking and management. the dashboard has functionlities to add sub admins and registring the restaurants and drivers securely and driver assignment to the restaurants. It's also the managing place to manage payments and settelments and reports etc.",
            "outcome": "After 2.5 months of development, around 600 git commits and crafting & managing service classes and endpoints for a database of 32 SQL tables, I finally reach to near end of this platform development. After a real hassel I have been able to develop a robus and complete working platfrom (Not some simulation). Implement my best knowledge of backend and frontend development to make this system work in real-time with all the functionlities required for a food delivery system. The system is now capable of handling thousands of concurrent users with real-time updates, secure transactions, and reliable email communications. This project has significantly enhanced my skills in full-stack development, real-time data handling, and system architecture design."
        }
    },
    {
        "id": 2,
        "title": "Con-Soul",
        "description": "To redefine the way people discover and book premium nightlife and travel experiences, combining luxury with adventure through an intuitive digital interface.",
        "longDescription": "Con-Soul is a high-end travel and adventure management platform designed specifically for nightlife, exploration, and premium trip experiences. Built with modern web technologies, it offers a seamless experience for both travelers looking for their next adventure and administrators managing trip logistics.",
        "thumbnail": "https://pub-88542caeb82a4635aa980b4aeb205cb5.r2.dev/portfolio/wallpaper/con.png",
        "videoUrl": "https://pub-88542caeb82a4635aa980b4aeb205cb5.r2.dev/portfolio/con-soul.mkv",
        "tags": [
            "Next.js",
            "Firestore",
            "Clerk",
            "IMGBB",
            "Tailwind CSS",
            "Vercel",
            "JWT Authentication",
            "Cloud"
        ],
        "stack": [
            {
                "name": "Next.js",
                "logo": "https://cdn.simpleicons.org/next.js/FFFFFF"
            },
            {
                "name": "Firestore",
                "logo": "https://cdn.simpleicons.org/firebase/DD2C00"
            },
            {
                "name": "Next.js",
                "logo": "https://cdn.simpleicons.org/next.js/FFFFFF"
            },
            {
                "name": "Clerk",
                "logo": "https://cdn.simpleicons.org/clerk/FFFFFF"
            },
            {
                "name": "Tailwind CSS",
                "logo": "https://cdn.simpleicons.org/tailwindcss/06B6D4"
            },
            {
                "name": "Vercel",
                "logo": "https://cdn.simpleicons.org/vercel/FFFFFF"
            }
        ],
        "github": "https://github.com/rahulsainijeelo/con-soul",
        "link": "https://con-soul.in",
        "sections": {
            "challenges": "Making unique apealing design that stands out in the competitive travel and nightlife market while ensuring high performance and scalability to handle peak traffic during holiday seasons.Implementing dual user roles, user and admin, with distinct functionalities and secure access controls for each. Ensuring real-time updates for bookings and availability to prevent overbooking and enhance user experience.",
            "solutions": "Utilized Next.js for server-side rendering to enhance SEO and load times. Employed Tailwind CSS for rapid styling and responsive design. Implemented Firestore for a scalable NoSQL database solution, ensuring real-time data synchronization across the platform. Integrated Clerk for secure and seamless user authentication.",
            "features": "Trip discovery options, secure booking system, admin dashboard for managing trips and user bookings. Next.js api routes were used to handle backend operations like fetching trip data, managing bookings.",
            "outcome": "Successfully launched the platform, attracting a niche audience of luxury travelers. The admin dashboard streamlined trip management, reducing manual workload by 40%. User feedback highlighted the platform's ease of use and appealing design, leading to a 25% increase in bookings within the first quarter post-launch."
        }
    },
    {
        "id": 3,
        "title": "Kurukshetra: Article Platform",
        "description": "A mobile application for reading and managing articles, built with Next.js",
        "longDescription": "The focus was on creating a clean, responsive reading experience with smooth navigation across new and trending articles. Along with the reader-facing UI, I implemented a complete admin dashboard with secure user authentication, supporting both email OTP login and Google sign-in.",
        "thumbnail": "https://pub-88542caeb82a4635aa980b4aeb205cb5.r2.dev/portfolio/wallpaper/kuru.png",
        "videoUrl": "https://pub-88542caeb82a4635aa980b4aeb205cb5.r2.dev/portfolio/kurukshetra.mkv",
        "tags": [
            "Next.js",
            "Clerk",
            "Firestore",
            "Cloudflare R2",
            "css",
            "Tailwind CSS",
            "UI/UX",
            "Mobile",
            "Articles"
        ],
        "stack": [
            {
                "name": "Next.js",
                "logo": "https://cdn.simpleicons.org/next.js/FFFFFF"
            },
            {
                "name": "Clerk",
                "logo": "https://cdn.simpleicons.org/clerk/FFFFFF"
            },
            {
                "name": "Firestore",
                "logo": "https://cdn.simpleicons.org/firebase/DD2C00"
            },
            {
                "name": "Cloudflare",
                "logo": "https://cdn.simpleicons.org/cloudflare/F38020"
            },
            {
                "name": "Tailwind CSS",
                "logo": "https://cdn.simpleicons.org/tailwindcss/06B6D4"
            },
            {
                "name": "TypeScript",
                "logo": "https://cdn.simpleicons.org/typescript/3178C6"
            }
        ],
        "link": "https://kurukshetra.info",
        "github":"https://github.com/rahulsainijeelo/kurukshetra",
        "sections": {
            "challenges": "Creating fluid, high-performance animations on mobile devices while ensuring consistent theming and layout across various screen sizes.",
            "solutions": "Leveraged Tailwind CSS for responsive design and implemented optimized animation libraries like Framer Motion to achieve smooth transitions without compromising performance.",
            "features": "Dark mode support, customizable reading fonts and sizes, offline article caching, and an intuitive admin dashboard for content management. Next.js server-side rendering was used to enhance SEO and initial load times.Next.js api routes were used to handle backend operations like fetching articles, user authentication, and managing user preferences.",
            "outcome": "Achieved a 25% increase in user engagement due to improved UX/UI, with a 40% reduction in load times on mobile devices, leading to higher retention rates."
        }
    },
    {
        "id": 4,
        "title": "Somufilms: Studio Portfolio",
        "description": "Portfolio website for Somufilms, showcasing their photography and film projects and services.",
        "longDescription": "Somufilms is a creative studio specializing in photography and filmmaking. The portfolio website is designed to showcase their diverse range of projects, from cinematic films to stunning photography collections. Built with Next.js, the site features a sleek, modern design that highlights their work while providing an intuitive user experience.",
        "thumbnail": "https://pub-88542caeb82a4635aa980b4aeb205cb5.r2.dev/portfolio/wallpaper/s.png",
        "videoUrl": "https://pub-88542caeb82a4635aa980b4aeb205cb5.r2.dev/portfolio/somu.mkv",
        "tags": [
            "Next.js",
            "JWT Authentication",
            "Firestore",
            "IMGBB",
            "Tailwind CSS",
            "Vercel",
            "Cloudflare R2"
        ],
        "stack": [
            {
                "name": "Next.js",
                "logo": "https://cdn.simpleicons.org/nextdotjs/FFFFFF"
            },
            {
                "name": "github",
                "logo": "https://cdn.simpleicons.org/github/FFFFFF"
            },            
            {
                "name": "Firestore",
                "logo": "https://cdn.simpleicons.org/firebase/DD2C00"
            },  
            {
                "name": "Tailwind CSS",
                "logo": "https://cdn.simpleicons.org/tailwindcss/06B6D4"
            },
            {
                "name": "Vercel",
                "logo": "https://cdn.simpleicons.org/vercel/FFFFFF"
            },
            {
                "name": "Cloudflare",
                "logo": "https://cdn.simpleicons.org/cloudflare/F38020"
            }
        ],
        "link": "https://somufilms.in",
        "github":"https://github.com/himanshuinfotech2005/studio",
        "sections": {
            "challenges": "Implementing unique gallery layouts that adapt seamlessly to various screen sizes while maintaining high performance and fast load times. Also crafting unique design that stands out from typical studio portfolio sites.",
            "solutions": "Utilized Next.js's image optimization features and dynamic routing to create responsive galleries. Employed Tailwind CSS for rapid styling and layout adjustments, ensuring a consistent look across devices. Focused on custom animations and transitions to enhance user engagement. Carefully using next.js api routes to handle backend operations like fetching project data and managing contact form submissions.",
            "features": "Dynamic project showcases with video and image support, client testimonials section, integrated contact form with spam protection, and a blog for sharing behind-the-scenes content. Video graphy section, photography section with categorized albums,blogs and a contact page detailing offerings.",
            "outcome": "Working on real life project and collaborating with a creative team enhanced my ability to translate artistic vision into functional web design. The site achieved a 30% increase in client inquiries within the first month of launch, demonstrating its effectiveness in attracting potential clients."
        }
    },
    {
        "id": 5,
        "title": "Ticker: Unique Time and Goal Manager",
        "description": "A comprehensive productivity web application that transforms how users track and manage their daily goals with gamified progress tracking and intelligent timer functionality.",
        "longDescription": "A comprehensive productivity web application that transforms how users track and manage their daily goals with gamified progress tracking and intelligent timer functionality. The platform's intuitive interface allows users to set, monitor, and achieve their goals through customizable timers and progress visualizations, making productivity engaging and rewarding.",
        "thumbnail": "https://pub-88542caeb82a4635aa980b4aeb205cb5.r2.dev/portfolio/wallpaper/ticker.png",
        "videoUrl": "https://pub-88542caeb82a4635aa980b4aeb205cb5.r2.dev/portfolio/ticker.mkv",
        "tags": [
            "React",
            "Vercel",
            "css",
            "UI/UX",
            "Firestore",
            "Clerk",
            "github"
        ],
        "stack": [
            {
                "name": "React",
                "logo": "https://cdn.simpleicons.org/react/61DAFB"
            },
            {
                "name": "Vercel",
                "logo": "https://cdn.simpleicons.org/vercel/FFFFFF"
            },
            {
                "name": "Firestore",
                "logo": "https://cdn.simpleicons.org/firebase/DD2C00"
            },
            {
                "name": "Clerk",
                "logo": "https://cdn.simpleicons.org/clerk/FFFFFF"
            },
            {
                "name": "github",
                "logo": "https://cdn.simpleicons.org/github/FFFFFF"
            },
            {
                "name": "Tailwind CSS",
                "logo": "https://cdn.simpleicons.org/tailwindcss/06B6D4"
            },
            {
                "name": "javascript",
                "logo": "https://cdn.simpleicons.org/javascript/F7DF1E"
            }
        ],
        "github":"https://github.com/rahulsainijeelo/ticker",
        "link": "https://ticker.iamsaini.space",
        "sections": {
            "challenges": "Designing an engaging user interface that effectively combines goal tracking with time management, while ensuring the application remains intuitive and easy to navigate.",
            "solutions": "Implemented a modular design approach using React components, allowing for reusable UI elements and consistent styling.",
            "features": "Customizable goal setting, integrated Pomodoro timer, progress visualization through charts, and gamification elements such as badges achieving milestones.",
            "outcome": "It's an personal project that I developed purely with javascript and without any backend while still maintaining database for state of the user. Gained valuable experience in frontend development."
        }
    }
]